; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image5 - mode
	image0 - mode
	infrared10 - mode
	spectrograph1 - mode
	thermograph7 - mode
	spectrograph9 - mode
	thermograph3 - mode
	image4 - mode
	thermograph6 - mode
	spectrograph2 - mode
	spectrograph8 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	Star1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph8)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star1)
	(supports instrument1 image5)
	(supports instrument1 image4)
	(supports instrument1 thermograph7)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph6)
	(supports instrument2 spectrograph9)
	(supports instrument2 infrared10)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(have_image Star5 image4)
	(have_image Phenomenon6 spectrograph8)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon6 spectrograph2)
	(have_image Planet7 image4)
	(have_image Planet7 infrared10)
	(have_image Planet7 spectrograph2)
	(have_image Phenomenon8 thermograph6)
	(have_image Phenomenon8 thermograph7)
	(have_image Phenomenon8 image4)
	(have_image Planet9 spectrograph9)
	(have_image Planet9 spectrograph1)
	(have_image Planet9 spectrograph8)
))

)

; plan
1. (turn_to satellite0 star1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star1)
   goals met: 0 of 14
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   goals met: 0 of 14
5. (take_image satellite0 planet9 instrument2 spectrograph9)
   added: (have_image planet9 spectrograph9)
   goals met: 1 of 14
6. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   goals met: 1 of 14
7. (take_image satellite0 planet7 instrument2 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 2 of 14
8. (take_image satellite0 planet7 instrument2 infrared10)
   added: (have_image planet7 infrared10)
   goals met: 3 of 14
9. (turn_to satellite0 phenomenon8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 14
10. (take_image satellite0 phenomenon8 instrument2 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 5 of 14
11. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 14
12. (take_image satellite0 phenomenon6 instrument2 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 5 of 14
13. (turn_to satellite0 star1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star1)
   goals met: 5 of 14
14. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 5 of 14
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 14
16. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 5 of 14
17. (turn_to satellite0 phenomenon6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 14
18. (take_image satellite0 phenomenon6 instrument0 image0)
   added: (have_image phenomenon6 image0)
   goals met: 6 of 14
19. (take_image satellite0 phenomenon6 instrument0 spectrograph8)
   added: (have_image phenomenon6 spectrograph8)
   goals met: 7 of 14
20. (turn_to satellite0 planet9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet9)
   goals met: 7 of 14
21. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 8 of 14
22. (take_image satellite0 planet9 instrument0 spectrograph8)
   added: (have_image planet9 spectrograph8)
   goals met: 9 of 14
23. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 9 of 14
24. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 9 of 14
25. (turn_to satellite0 star3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star3)
   goals met: 9 of 14
26. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 9 of 14
27. (turn_to satellite0 planet7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet7)
   goals met: 9 of 14
28. (take_image satellite0 planet7 instrument1 image4)
   added: (have_image planet7 image4)
   goals met: 10 of 14
29. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   goals met: 10 of 14
30. (take_image satellite0 star5 instrument1 image4)
   added: (have_image star5 image4)
   goals met: 11 of 14
31. (turn_to satellite0 phenomenon8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon8)
   goals met: 12 of 14
32. (take_image satellite0 phenomenon8 instrument1 image4)
   added: (have_image phenomenon8 image4)
   goals met: 13 of 14
33. (take_image satellite0 phenomenon8 instrument1 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 14 of 14
